Revit 2027 API
BuiltInFailures.DocumentFailures.DUMisbehavingUpdater Property
 Third party updater '[Name]' has experienced a problem and its action had to be canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DUMisbehavingUpdater { get; }
Public Shared ReadOnly Property DUMisbehavingUpdater As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DUMisbehavingUpdater {
	FailureDefinitionId^ get ();
}
static member DUMisbehavingUpdater : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace